tutorials/heatTransfer/heatSimpleFoam/ImpJet-NFF/constant/ImpingedWall/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/ImpingedWall/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    Ambient
    {
        type            patch;
        nFaces          17;
        startFace       1006;
    }
    Entrainment
    {
        type            patch;
        nFaces          0;
        startFace       1023;
    }
    ImpingedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          31;
        startFace       1023;
    }
    oldInternalFaces
    {
        type            patch;
        nFaces          31;
        startFace       1054;
    }
    Inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          0;
        startFace       1085;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  Outlet;
    }
    Outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          0;
        startFace       1085;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  Inlet;
    }
    ExtPipeWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       1085;
    }
    Wedge1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          527;
        startFace       1085;
    }
    Wedge2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          527;
        startFace       1612;
    }
    Symm
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          0;
        startFace       2139;
    }
    mappedInlet
    {
        type            mappedPatch;
        inGroups        1(mappedPatch);
        nFaces          0;
        startFace       2139;
        sampleMode      nearestCell;
        sampleRegion    region0;
        samplePatch     none;
        offsetMode      normal;
        distance        0.5;
    }
)

// ************************************************************************* //
