tutorials/heatTransfer/heatSimpleFoam/ImpJet-NFF/0/ImpingedWall/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "1e-05";
 object p;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  Ambient
  {
    type fixedValue;
    value uniform 0;
  }
  Entrainment
  {
    type fixedValue;
    value nonuniform 0
(
)
;
  }
  ImpingedWall
  {
    type zeroGradient;
  }
  oldInternalFaces
  {
    type fixedValue;
    value uniform 0;
  }
  Inlet
  {
    type cyclic;
  }
  Outlet
  {
    type cyclic;
  }
  ExtPipeWall
  {
    type zeroGradient;
  }
  Wedge1
  {
    type wedge;
  }
  Wedge2
  {
    type wedge;
  }
  Symm
  {
    type symmetryPlane;
  }
  mappedInlet
  {
    type zeroGradient;
  }
} 	// ************************************************************************* //

