tutorials/heatTransfer/heatSimpleFoam/ImpJet-NFF/0/ImpingedWall/k
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "1e-05";
 object k;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 1;

boundaryField
{
  Ambient
  {
    type zeroGradient;
  }
  Entrainment
  {
    type zeroGradient;
  }
  ImpingedWall
  {
    type fixedValue;
    value uniform 1e-12;
  }
  oldInternalFaces
  {
    type zeroFlux;
  }
  Inlet
  {
    type cyclic;
  }
  Outlet
  {
    type cyclic;
  }
  ExtPipeWall
  {
    type fixedValue;
    value nonuniform 0
(
)
;
  }
  Wedge1
  {
    type wedge;
  }
  Wedge2
  {
    type wedge;
  }
  Symm
  {
    type symmetryPlane;
  }
  mappedInlet
  {
    type mapped;
    fieldName k;
    setAverage 0;
    average 1;
    interpolationScheme cell;
    value nonuniform 0
(
)
;
  }
} 	// ************************************************************************* //

